In [53]:
import pandas as pd
import sklearn
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [54]:
train_data = pd.read_csv('TRAIN.csv')
train_data

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (7) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

        Store  DayOfWeek        Date  ...  Promo  StateHoliday  SchoolHoliday
0           1          5  2015-07-31  ...      1             0              1
1           2          5  2015-07-31  ...      1             0              1
2           3          5  2015-07-31  ...      1             0              1
3           4          5  2015-07-31  ...      1             0              1
4           5          5  2015-07-31  ...      1             0              1
...       ...        ...         ...  ...    ...           ...            ...
712041    342          2  2013-10-01  ...      0             0              0
712042    343          2  2013-10-01  ...      0             0              0
712043    344          2  2013-10-01  ...      0             0              1
712044    345          2  2013-10-01  ...      0             0              0
712045    346          2  2013-10-01  ...      0             0              0

[712046 rows x 9 columns]

In [55]:
train_data['StateHoliday'].unique()

array(['0', 'a', 'b', 'c', 0], dtype=object)

In [56]:
train_data['StateHoliday'] = train_data['StateHoliday'].replace([0],'0')

In [57]:
train_data['StateHoliday'].unique()

array(['0', 'a', 'b', 'c'], dtype=object)

In [58]:
train_data['SchoolHoliday'].unique()

array([1, 0])

In [59]:
train_data.isna().sum()

Store            0
DayOfWeek        0
Date             0
Sales            0
Customers        0
Open             0
Promo            0
StateHoliday     0
SchoolHoliday    0
dtype: int64

In [60]:
train_data = train_data.dropna()

In [61]:
train_data.isna().sum()

Store            0
DayOfWeek        0
Date             0
Sales            0
Customers        0
Open             0
Promo            0
StateHoliday     0
SchoolHoliday    0
dtype: int64

In [62]:
X = train_data.drop(['Sales','Customers','Date'],axis=1)
Y = train_data['Sales']
Y

0          5263
1          6064
2          8314
3         13995
4          4822
          ...
712041    10182
712042     5352
712043     6652
712044     3842
712045     6143
Name: Sales, Length: 712046, dtype: int64

In [64]:
from sklearn.model_selection import train_test_split
X_train,X_valid,Y_train,Y_valid = train_test_split(X,Y,test_size=0.2,random_state=0)

In [71]:
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import OneHotEncoder
categorical_transformer = Pipeline(steps=[
        ('onehot', OneHotEncoder(handle_unknown='ignore'))
])
preprocessor = ColumnTransformer(
    transformers=[
        ('cat', categorical_transformer, ['DayOfWeek'])
    ])

In [72]:
from sklearn.linear_model import LinearRegression
model_1 = LinearRegression()

In [73]:
my_pipeline = Pipeline(steps=[('preprocessor', preprocessor),
                              ('model_1', model_1)
                             ])

my_pipeline.fit(X_train,Y_train)

Pipeline(memory=None,
         steps=[('preprocessor',
                 ColumnTransformer(n_jobs=None, remainder='drop',
                                   sparse_threshold=0.3,
                                   transformer_weights=None,
                                   transformers=[('cat',
                                                  Pipeline(memory=None,
                                                           steps=[('onehot',
                                                                   OneHotEncoder(categories='auto',
                                                                                 drop=None,
                                                                                 dtype=<class 'numpy.float64'>,
                                                                                 handle_unknown='ignore',
                                                                                 sparse=True))],
                                                           verbose=False),
                                                  ['DayOfWeek'])],
                                   verbose=False)),
                ('model_1',
                 LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
                                  normalize=False))],
         verbose=False)

In [75]:
y_train_pred = my_pipeline.predict(X_train)
y_valid_pred = my_pipeline.predict(X_valid)

In [78]:
from sklearn.metrics import mean_squared_error
rmse = np.sqrt(mean_squared_error(Y_train,y_train_pred))

print("The model performance for training set")
print('RMSE is {}'.format(rmse))
print("\n")

rmse = np.sqrt(mean_squared_error(Y_valid,y_valid_pred))

print("The model performance for training set")
print('RMSE is {}'.format(rmse))
print("\n")

The model performance for training set
RMSE is 3111.35982203522


The model performance for training set
RMSE is 3108.6368642847196

In [80]:
test_data = pd.read_csv('TEST.csv')
test_data = test_data.drop('Date',axis=1)
test_data

        Store  DayOfWeek  Open  Promo StateHoliday  SchoolHoliday
0         767          1     0      0            b              1
1        1111          6     1      0            0              0
2          45          4     1      1            0              1
3         500          4     1      0            0              1
4          82          2     1      0            0              1
...       ...        ...   ...    ...          ...            ...
305158    412          2     1      1            0              1
305159    936          6     1      0            0              0
305160     21          1     1      0            0              0
305161   1077          6     1      0            0              0
305162    321          6     1      0            0              0

[305163 rows x 6 columns]

In [84]:
y_test_pred = my_pipeline.predict(test_data)

In [89]:
index = [i for i in range(0,305163)]

In [92]:
output = pd.DataFrame(data=y_test_pred,columns=['Sales'])
output

              Sales
0       8009.466743
1       5974.138433
2       6251.225224
3       6251.225224
4       7180.523193
...             ...
305158  7180.523193
305159  5974.138433
305160  8009.466743
305161  5974.138433
305162  5974.138433

[305163 rows x 1 columns]

In [95]:
output_csv = output.to_csv('output.csv',index=True)

In [96]:
df = pd.read_csv('output.csv')
df.head()

   Unnamed: 0        Sales
0           0  8009.466743
1           1  5974.138433
2           2  6251.225224
3           3  6251.225224
4           4  7180.523193